### Importing Libraries

In [1]:
import pandas as pd 
import numpy as np
#import seaborn as sns
import matplotlib.pyplot as plt

### Importing dataframes

In [229]:
# by country
total_by_country = pd.read_csv('annual_2010_2021.csv.gz')  #done
by_country_intraeu = pd.read_csv('by_country_intraEU_2018_2021.csv.gz') #done
by_country_extraeu = pd.read_csv('by_country_extraEU_2018_2021.csv.gz') #done
by_country_national = pd.read_csv('by_country_national_2018_2021.csv.gz') #done

# by airport
# below converted to top_10_airport and added taht too
total_by_airport = pd.read_csv('total_by_airport_2018_2021.csv.gz') 

#to regions
eu_to_world = pd.read_csv('EU_to_world_2018_2021.csv.gz')

#this one will go to tableau for graph
intra_extra_national = pd.read_csv('intra_extra_national.csv.gz')

# about 2022
by_country_monthly_2018_2022 = pd.read_csv('total_by_country_2022.csv.gz')
quarterly_2022 = pd.read_csv('quarterly_2022.csv.gz')
monthly_2010_2022 = pd.read_csv('monthly_2010_2022.csv.gz')
eu_to_world_2022 = pd.read_csv('EU_to_world_2022.csv.gz')

### Cleaning & concating dataframes

First, cleaning dataframes by_country

In [3]:
def data_info(df):
    print('dataframe shape: ')
    display(df.shape)
    print('dataframe head')
    display(df.head())
    print('dataframe NaN values sum')
    display(df.isna().sum())
    print('dataframe data types')
    display(df.dtypes)
    print('dataframe column unique values')
    display(df.nunique())

In [4]:
data_info(total_by_country)

dataframe shape:

(324, 11)

dataframe head

,DATAFLOW,LAST UPDATE,freq,unit,tra_meas,tra_cov,schedule,geo,TIME_PERIOD,OBS_VALUE,OBS_FLAG
0,ESTAT:AVIA_PAOC(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,TOTAL,TOT,AT,2010,23532455,NaN
1,ESTAT:AVIA_PAOC(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,TOTAL,TOT,AT,2011,25137612,NaN
2,ESTAT:AVIA_PAOC(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,TOTAL,TOT,AT,2012,25965977,NaN
3,ESTAT:AVIA_PAOC(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,TOTAL,TOT,AT,2013,25749724,NaN
4,ESTAT:AVIA_PAOC(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,TOTAL,TOT,AT,2014,26378676,NaN

dataframe NaN values sum

DATAFLOW         0
LAST UPDATE      0
freq             0
unit             0
tra_meas         0
tra_cov          0
schedule         0
geo              0
TIME_PERIOD      0
OBS_VALUE        0
OBS_FLAG       324
dtype: int64

dataframe data types

DATAFLOW        object
LAST UPDATE     object
freq            object
unit            object
tra_meas        object
tra_cov         object
schedule        object
geo             object
TIME_PERIOD      int64
OBS_VALUE        int64
OBS_FLAG       float64
dtype: object

dataframe column unique values

DATAFLOW         1
LAST UPDATE      1
freq             1
unit             1
tra_meas         1
tra_cov          1
schedule         1
geo             27
TIME_PERIOD     12
OBS_VALUE      324
OBS_FLAG         0
dtype: int64

In [5]:
data_info(by_country_intraeu)

dataframe shape:

(108, 10)

dataframe head

,DATAFLOW,LAST UPDATE,freq,unit,tra_meas,partner,geo,TIME_PERIOD,OBS_VALUE,OBS_FLAG
0,ESTAT:AVIA_PAINCC(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,EU27_2020,AT,2018,18802523,NaN
1,ESTAT:AVIA_PAINCC(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,EU27_2020,AT,2019,21917098,NaN
2,ESTAT:AVIA_PAINCC(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,EU27_2020,AT,2020,5798874,NaN
3,ESTAT:AVIA_PAINCC(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,EU27_2020,AT,2021,7243649,NaN
4,ESTAT:AVIA_PAINCC(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,EU27_2020,BE,2018,23086308,NaN

dataframe NaN values sum

DATAFLOW         0
LAST UPDATE      0
freq             0
unit             0
tra_meas         0
partner          0
geo              0
TIME_PERIOD      0
OBS_VALUE        0
OBS_FLAG       108
dtype: int64

dataframe data types

DATAFLOW        object
LAST UPDATE     object
freq            object
unit            object
tra_meas        object
partner         object
geo             object
TIME_PERIOD      int64
OBS_VALUE        int64
OBS_FLAG       float64
dtype: object

dataframe column unique values

DATAFLOW         1
LAST UPDATE      1
freq             1
unit             1
tra_meas         1
partner          1
geo             27
TIME_PERIOD      4
OBS_VALUE      108
OBS_FLAG         0
dtype: int64

In [6]:
data_info(by_country_extraeu)

dataframe shape:

(108, 10)

dataframe head

,DATAFLOW,LAST UPDATE,freq,unit,tra_meas,partner,geo,TIME_PERIOD,OBS_VALUE,OBS_FLAG
0,ESTAT:AVIA_PAEXCC(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,EXT_EU,AT,2018,11750717,NaN
1,ESTAT:AVIA_PAEXCC(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,EXT_EU,AT,2019,13177036,NaN
2,ESTAT:AVIA_PAEXCC(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,EXT_EU,AT,2020,3225444,NaN
3,ESTAT:AVIA_PAEXCC(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,EXT_EU,AT,2021,3747606,NaN
4,ESTAT:AVIA_PAEXCC(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,EXT_EU,BE,2018,11411220,NaN

dataframe NaN values sum

DATAFLOW         0
LAST UPDATE      0
freq             0
unit             0
tra_meas         0
partner          0
geo              0
TIME_PERIOD      0
OBS_VALUE        0
OBS_FLAG       108
dtype: int64

dataframe data types

DATAFLOW        object
LAST UPDATE     object
freq            object
unit            object
tra_meas        object
partner         object
geo             object
TIME_PERIOD      int64
OBS_VALUE        int64
OBS_FLAG       float64
dtype: object

dataframe column unique values

DATAFLOW         1
LAST UPDATE      1
freq             1
unit             1
tra_meas         1
partner          1
geo             27
TIME_PERIOD      4
OBS_VALUE      108
OBS_FLAG         0
dtype: int64

In [7]:
data_info(by_country_national)

dataframe shape:

(106, 9)

dataframe head

,DATAFLOW,LAST UPDATE,freq,unit,tra_meas,geo,TIME_PERIOD,OBS_VALUE,OBS_FLAG
0,ESTAT:AVIA_PANC(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,AT,2018,585177,NaN
1,ESTAT:AVIA_PANC(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,AT,2019,550054,NaN
2,ESTAT:AVIA_PANC(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,AT,2020,144113,NaN
3,ESTAT:AVIA_PANC(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,AT,2021,114309,NaN
4,ESTAT:AVIA_PANC(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,BE,2018,8781,NaN

dataframe NaN values sum

DATAFLOW         0
LAST UPDATE      0
freq             0
unit             0
tra_meas         0
geo              0
TIME_PERIOD      0
OBS_VALUE        0
OBS_FLAG       106
dtype: int64

dataframe data types

DATAFLOW        object
LAST UPDATE     object
freq            object
unit            object
tra_meas        object
geo             object
TIME_PERIOD      int64
OBS_VALUE        int64
OBS_FLAG       float64
dtype: object

dataframe column unique values

DATAFLOW         1
LAST UPDATE      1
freq             1
unit             1
tra_meas         1
geo             27
TIME_PERIOD      4
OBS_VALUE      100
OBS_FLAG         0
dtype: int64

In [8]:
def clean_by_country(df):
    df = df[['geo', 'TIME_PERIOD', 'OBS_VALUE']]
    df.columns = ['country_code', 'year', 'value']
    return df

In [9]:
total_by_country = clean_by_country(total_by_country)

In [10]:
by_country_intraeu = clean_by_country(by_country_intraeu)

In [11]:
by_country_extraeu = clean_by_country(by_country_extraeu)

In [12]:
by_country_national = clean_by_country(by_country_national)

adding country names

In [13]:
total_by_country['country_code'].unique()

array(['AT', 'BE', 'BG', 'CY', 'CZ', 'DE', 'DK', 'EE', 'EL', 'ES', 'FI',
       'FR', 'HR', 'HU', 'IE', 'IT', 'LT', 'LU', 'LV', 'MT', 'NL', 'PL',
       'PT', 'RO', 'SE', 'SI', 'SK'], dtype=object)

In [14]:
def country_names(x):
    
    if x in ['AT']:
        return 'Austria'
    elif x in ['BE']:
        return 'Belgium'
    elif x in ['BG']:
        return 'Bulgaria'
    elif x in ['CY']:
        return 'Cyprus'
    elif x in ['CZ']:
        return 'Czechia'
    elif x in ['DE']:
        return 'Germany'
    elif x in ['DK']:
        return 'Denmark'
    elif x in ['EE']:
        return 'Estonia'
    elif x in ['EL']:
        return 'Greece'
    elif x in ['ES']:
        return 'Spain'
    elif x in ['FI']:
        return 'Finland'
    elif x in ['FR']:
        return 'France'
    elif x in ['HR']:
        return 'Croatia'
    elif x in ['HU']:
        return 'Hungary'
    elif x in ['IE']:
        return 'Ireland'
    elif x in ['IT']:
        return 'Italy'
    elif x in ['LT']:
        return 'Lithuania'
    elif x in ['LU']:
        return 'Luxembourg'
    elif x in ['LV']:
        return 'Latvia'
    elif x in ['MT']:
        return 'Malta'
    elif x in ['NL']:
        return 'Netherlands'
    elif x in ['PL']:
        return 'Poland'
    elif x in ['PT']:
        return 'Portugal'
    elif x in ['RO']:
        return 'Romania'
    elif x in ['SE']:
        return 'Sweden'
    elif x in ['SI']:
        return 'Slovenia'
    elif x in ['SK']:
        return 'Slovakia'  
    else:
        return 'U'

In [15]:
total_by_country['country'] = total_by_country['country_code'].apply(lambda x: country_names(x))
total_by_country = total_by_country[['country_code','country','year','value']]

In [16]:
by_country_intraeu['country'] = by_country_intraeu['country_code'].apply(lambda x: country_names(x))
by_country_intraeu = by_country_intraeu[['country_code','country','year','value']]

In [17]:
by_country_extraeu['country'] = by_country_extraeu['country_code'].apply(lambda x: country_names(x))
by_country_extraeu = by_country_extraeu[['country_code','country','year','value']]

In [18]:
by_country_national['country'] = by_country_national['country_code'].apply(lambda x: country_names(x))
by_country_national = by_country_national[['country_code','country','year','value']]

cleaning by_airport dataframes
I need top 10 airports in 2021

In [19]:
data_info(total_by_airport)

dataframe shape:

(1527, 11)

dataframe head

,DATAFLOW,LAST UPDATE,freq,unit,tra_meas,rep_airp,schedule,tra_cov,TIME_PERIOD,OBS_VALUE,OBS_FLAG
0,ESTAT:AVIA_PAOA(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,AT_LOWG,TOT,TOTAL,2018,1026686,NaN
1,ESTAT:AVIA_PAOA(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,AT_LOWG,TOT,TOTAL,2019,1035264,NaN
2,ESTAT:AVIA_PAOA(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,AT_LOWG,TOT,TOTAL,2020,199694,NaN
3,ESTAT:AVIA_PAOA(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,AT_LOWG,TOT,TOTAL,2021,226336,NaN
4,ESTAT:AVIA_PAOA(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,AT_LOWI,TOT,TOTAL,2018,1124389,NaN

dataframe NaN values sum

DATAFLOW          0
LAST UPDATE       0
freq              0
unit              0
tra_meas          0
rep_airp          0
schedule          0
tra_cov           0
TIME_PERIOD       0
OBS_VALUE         0
OBS_FLAG       1526
dtype: int64

dataframe data types

DATAFLOW       object
LAST UPDATE    object
freq           object
unit           object
tra_meas       object
rep_airp       object
schedule       object
tra_cov        object
TIME_PERIOD     int64
OBS_VALUE       int64
OBS_FLAG       object
dtype: object

dataframe column unique values

DATAFLOW          1
LAST UPDATE       1
freq              1
unit              1
tra_meas          1
rep_airp        417
schedule          1
tra_cov           1
TIME_PERIOD       4
OBS_VALUE      1524
OBS_FLAG          1
dtype: int64

In [20]:
top_10_airport = total_by_airport[(total_by_airport['TIME_PERIOD'].isin([2021]))].sort_values(['OBS_VALUE'], ascending=False)

In [21]:
top_10_airport.head(10)

,DATAFLOW,LAST UPDATE,freq,unit,tra_meas,rep_airp,schedule,tra_cov,TIME_PERIOD,OBS_VALUE,OBS_FLAG
736,ESTAT:AVIA_PAOA(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,FR_LFPG,TOT,TOTAL,2021,26187008,NaN
1041,ESTAT:AVIA_PAOA(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,NL_EHAM,TOT,TOTAL,2021,25490810,NaN
127,ESTAT:AVIA_PAOA(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,DE_EDDF,TOT,TOTAL,2021,24765459,NaN
484,ESTAT:AVIA_PAOA(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,ES_LEMD,TOT,TOTAL,2021,23193459,NaN
458,ESTAT:AVIA_PAOA(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,ES_LEBL,TOT,TOTAL,2021,18475486,NaN
740,ESTAT:AVIA_PAOA(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,FR_LFPO,TOT,TOTAL,2021,15719099,NaN
499,ESTAT:AVIA_PAOA(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,ES_LEPA,TOT,TOTAL,2021,14474127,NaN
258,ESTAT:AVIA_PAOA(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,EL_LGAV,TOT,TOTAL,2021,13356385,NaN
147,ESTAT:AVIA_PAOA(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,DE_EDDM,TOT,TOTAL,2021,12473832,NaN
1286,ESTAT:AVIA_PAOA(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,PT_LPPT,TOT,TOTAL,2021,12154747,NaN

In [22]:
top_10_airport = top_10_airport[['rep_airp', 'TIME_PERIOD', 'OBS_VALUE']]

In [23]:
top_10_airport.columns = ['airport_code', 'year', 'value']

In [24]:
def airport_names(x):
    
    if x in ['FR_LFPG']:
        return 'Paris Charles de Gaulle Airport'
    elif x in ['NL_EHAM']:
        return 'Amsterdam Airport Schiphol'
    elif x in ['DE_EDDF']:
        return 'Frankfurt International Airport'
    elif x in ['ES_LEMD']:
        return 'Madrid-Barajas Airport'
    elif x in ['ES_LEBL']:
        return 'Barcelona International Airport'
    elif x in ['FR_LFPO']:
        return 'Paris Orly Airport'
    elif x in ['ES_LEPA']:
        return 'Palma De Mallorca Airport'
    elif x in ['EL_LGAV']:
        return 'Athens International Airport'
    elif x in ['DE_EDDM']:
        return 'Munich International Airport' 
    elif x in ['PT_LPPT']:
        return 'Lisbon Airport'
    else:
        return 'U'

In [25]:
top_10_airport['airport'] = top_10_airport['airport_code'].apply(lambda x: airport_names(x))

In [26]:
top_10_airport = top_10_airport[['airport_code','airport','year','value']]

In [27]:
total_by_airport = total_by_airport[['rep_airp', 'TIME_PERIOD', 'OBS_VALUE']]

In [28]:
total_by_airport.columns = ['airport_code', 'year', 'value']

cleaning to regions

In [29]:
data_info(eu_to_world)

dataframe shape:

(56, 10)

dataframe head

,DATAFLOW,LAST UPDATE,freq,unit,tra_meas,partner,geo,TIME_PERIOD,OBS_VALUE,OBS_FLAG
0,ESTAT:AVIA_PAEXCC(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,AFR_C,EU27_2020,2018,1639554,NaN
1,ESTAT:AVIA_PAEXCC(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,AFR_C,EU27_2020,2019,1740232,NaN
2,ESTAT:AVIA_PAEXCC(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,AFR_C,EU27_2020,2020,636682,NaN
3,ESTAT:AVIA_PAEXCC(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,AFR_C,EU27_2020,2021,916951,NaN
4,ESTAT:AVIA_PAEXCC(1.0),05/12/22 23:00:00,A,PAS,PAS_CRD,AFR_E,EU27_2020,2018,4562331,NaN

dataframe NaN values sum

DATAFLOW        0
LAST UPDATE     0
freq            0
unit            0
tra_meas        0
partner         0
geo             0
TIME_PERIOD     0
OBS_VALUE       0
OBS_FLAG       56
dtype: int64

dataframe data types

DATAFLOW        object
LAST UPDATE     object
freq            object
unit            object
tra_meas        object
partner         object
geo             object
TIME_PERIOD      int64
OBS_VALUE        int64
OBS_FLAG       float64
dtype: object

dataframe column unique values

DATAFLOW        1
LAST UPDATE     1
freq            1
unit            1
tra_meas        1
partner        14
geo             1
TIME_PERIOD     4
OBS_VALUE      56
OBS_FLAG        0
dtype: int64

In [30]:
eu_to_world = eu_to_world[['geo', 'partner', 'TIME_PERIOD', 'OBS_VALUE']]

In [31]:
eu_to_world.columns = ['from','region_code', 'year', 'value']

In [32]:
eu_to_world.head()

        from region_code  year    value
0  EU27_2020       AFR_C  2018  1639554
1  EU27_2020       AFR_C  2019  1740232
2  EU27_2020       AFR_C  2020   636682
3  EU27_2020       AFR_C  2021   916951
4  EU27_2020       AFR_E  2018  4562331

I will add coordinates to use in Tableau Later

In [33]:
eu_to_world[['start_latitude']] = ['50.378472']

In [34]:
eu_to_world[['start_longitude']] = ['14.970598']

In [35]:
eu_to_world['region_code'].unique()

array(['AFR_C', 'AFR_E', 'AFR_N', 'AFR_S', 'AFR_W', 'AME_C_CRB', 'AME_N',
       'AME_S', 'ASI_C', 'ASI_E', 'ASI_S', 'ASI_S_E', 'ASI_W', 'OCE_PLR'],
      dtype=object)

In [36]:
def latitude(x):
    
    if x in ['AFR_C', 'AFR_E', 'AFR_N', 'AFR_S', 'AFR_W']:
        return '5.662755'
    elif x in ['ASI_C', 'ASI_E', 'ASI_S', 'ASI_S_E', 'ASI_W']:
        return '37.764292'
    elif x in ['AME_N']:
        return '43.448934'
    elif x in ['AME_S']:
        return '-16.809795'
    elif x in ['AME_C_CRB']:
        return '20.530026'
    elif x in ['OCE_PLR']:
        return '-27.596967'
    else:
        return 'U'
# africa 5.662755, 20.619970
# asia 37.764292, 99.509360
# north america 43.448934, -103.020636
# south america -16.809795, -58.196417
# central america and caribbean 20.530026, -73.239431
# oceania and south polar -27.596967, 148.965118

In [37]:
eu_to_world["end_latitude"] = eu_to_world["region_code"].apply(lambda x: latitude(x))

In [38]:
def longitude(x):
    
    if x in ['AFR_C', 'AFR_E', 'AFR_N', 'AFR_S', 'AFR_W']:
        return '20.619970'
    elif x in ['ASI_C', 'ASI_E', 'ASI_S', 'ASI_S_E', 'ASI_W']:
        return '99.509360'
    elif x in ['AME_N']:
        return '-103.020636'
    elif x in ['AME_S']:
        return '-58.196417'
    elif x in ['AME_C_CRB']:
        return '-73.239431'
    elif x in ['OCE_PLR']:
        return '148.965118'
    else:
        return 'U'
# africa 5.662755, 20.619970
# asia 37.764292, 99.509360
# north america 43.448934, -103.020636
# south america -16.809795, -58.196417
# central america and caribbean 20.530026, -73.239431
# oceania and south polar -27.596967, 148.965118

In [39]:
eu_to_world["end_longitude"] = eu_to_world["region_code"].apply(lambda x: longitude(x))

In [40]:
eu_to_world.head()

,from,region_code,year,value,start_latitude,start_longitude,end_latitude,end_longitude
0,EU27_2020,AFR_C,2018,1639554,50.378472,14.970598,5.662755,20.619970
1,EU27_2020,AFR_C,2019,1740232,50.378472,14.970598,5.662755,20.619970
2,EU27_2020,AFR_C,2020,636682,50.378472,14.970598,5.662755,20.619970
3,EU27_2020,AFR_C,2021,916951,50.378472,14.970598,5.662755,20.619970
4,EU27_2020,AFR_E,2018,4562331,50.378472,14.970598,5.662755,20.619970

In [41]:
eu_to_world['region_code'].unique()

array(['AFR_C', 'AFR_E', 'AFR_N', 'AFR_S', 'AFR_W', 'AME_C_CRB', 'AME_N',
       'AME_S', 'ASI_C', 'ASI_E', 'ASI_S', 'ASI_S_E', 'ASI_W', 'OCE_PLR'],
      dtype=object)

In [125]:
def region_names(x):
    
    if x in ['AFR_C']:
        return 'Africa'
    elif x in ['AFR_E']:
        return 'Africa'
    elif x in ['AFR_N']:
        return 'Africa'
    elif x in ['AFR_S']:
        return 'Africa'
    elif x in ['AFR_W']:
        return 'Africa'
    elif x in ['AME_C_CRB']:
        return 'Central America and Caribbean'
    elif x in ['AME_N']:
        return 'North America'
    elif x in ['AME_S']:
        return 'South America'
    elif x in ['ASI_C']:
        return 'Asia' 
    elif x in ['ASI_E']:
        return 'Asia'
    elif x in ['ASI_S']:
        return 'Asia'
    elif x in ['ASI_S_E']:
        return 'Asia'
    elif x in ['ASI_W']:
        return 'Asia'
    elif x in ['OCE_PLR']:
        return 'Oceania and southern polar regions'
    else:
        return 'U'

In [126]:
eu_to_world["region"] = eu_to_world["region_code"].apply(lambda x: region_names(x))

In [127]:
eu_to_world.head()

,from,region_code,year,value,start_latitude,start_longitude,end_latitude,end_longitude,region
0,EU27_2020,AFR_C,2018,1639554,50.378472,14.970598,5.662755,20.619970,Africa
1,EU27_2020,AFR_C,2019,1740232,50.378472,14.970598,5.662755,20.619970,Africa
2,EU27_2020,AFR_C,2020,636682,50.378472,14.970598,5.662755,20.619970,Africa
3,EU27_2020,AFR_C,2021,916951,50.378472,14.970598,5.662755,20.619970,Africa
4,EU27_2020,AFR_E,2018,4562331,50.378472,14.970598,5.662755,20.619970,Africa

In [45]:
intra_extra_national.head()

,DATAFLOW,LAST UPDATE,freq,unit,tra_meas,tra_cov,schedule,geo,TIME_PERIOD,OBS_VALUE,OBS_FLAG
0,ESTAT:AVIA_PAOC(1.0),03/01/23 11:00:00,A,PAS,PAS_CRD,INTL_IEU27_2020,TOT,EU27_2020,2021,141501920,NaN
1,ESTAT:AVIA_PAOC(1.0),03/01/23 11:00:00,A,PAS,PAS_CRD,INTL_XEU27_2020,TOT,EU27_2020,2021,146267694,NaN
2,ESTAT:AVIA_PAOC(1.0),03/01/23 11:00:00,A,PAS,PAS_CRD,NAT,TOT,EU27_2020,2021,85965344,NaN

In [46]:
intra_extra_national = intra_extra_national[['tra_cov', 'TIME_PERIOD', 'OBS_VALUE']]

In [47]:
intra_extra_national.columns = ['tra_code', 'year', 'value']

In [48]:
def tra_names(x):
    
    if x in ['INTL_IEU27_2020']:
        return 'Internal_EU'
    elif x in ['INTL_XEU27_2020']:
        return 'External_EU'
    elif x in ['NAT']:
        return 'National'

In [49]:
intra_extra_national['tra_name'] = intra_extra_national['tra_code'].apply(lambda x: tra_names(x))

In [51]:
intra_extra_national = intra_extra_national[['tra_code', 'tra_name', 'year', 'value']]

In [52]:
intra_extra_national.head()

          tra_code     tra_name  year      value
0  INTL_IEU27_2020  Internal_EU  2021  141501920
1  INTL_XEU27_2020  External_EU  2021  146267694
2              NAT     National  2021   85965344

### importing tables to SQL

In [150]:
import pymysql                      
from sqlalchemy import create_engine 
from sqlalchemy import MetaData
from sqlalchemy_utils import database_exists, create_database
import getpass
password = getpass.getpass()

In [151]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/aviation'
engine = create_engine(connection_string)

if not database_exists(engine.url):
    create_database(engine.url)
    
metadata_obj = MetaData()

In [55]:
total_by_country.to_sql('total_by_country', engine, if_exists = 'replace')

324

In [56]:
by_country_intraeu.to_sql('by_country_intraeu', engine, if_exists = 'replace')

108

In [57]:
by_country_extraeu.to_sql('by_country_extraeu', engine, if_exists = 'replace')

108

In [58]:
by_country_national.to_sql('by_country_national', engine, if_exists = 'replace')

106

In [59]:
total_by_airport.to_sql('total_by_airport', engine, if_exists = 'replace')

1527

In [60]:
top_10_airport.to_sql('top_10_airport', engine, if_exists = 'replace')

358

In [128]:
eu_to_world.to_sql('eu_to_world', engine, if_exists = 'replace')

56

In [129]:
intra_extra_national.to_sql('intra_extra_national', engine, if_exists = 'replace')

3

## Hypothesis 1: Average passenger in 2021 is more than 30 million

 I asked this question because average in 2019 was 50 million. It must have been recovered more than half.

In [63]:
# To test our hypothesis we will apply one-sided test:
# Null hypothesis or H0: Average of passengers >= 30 million
# Alternative hyp or H1: Average of passengers < 30 million

In [67]:
query = 'SELECT value \
FROM total_by_country \
WHERE year = 2021;'

In [68]:
data = pd.read_sql_query(query, engine)

In [69]:
from scipy.stats import ttest_1samp

stat, pval = ttest_1samp(data, 30000000)

In [70]:
print('stat is  ', stat)
print('pvalue for the one-tailed test is ', pval/2)

stat is   [-2.39882243]
pvalue for the one-tailed test is  [0.01195646]

As per pvalue is smaller than 0.5, we reject the null hypothesis. When we look at stats, which is negative we can say that, average passenger in 2021 is less than 30 million.

### Pulling SQL queries to save as excel file and send to tableau

-- 1. General look at passenger counts (seats occupied, arrival-departure) between 2010-2021 in millions.

In [77]:
query1 = "SELECT year, round(SUM(value)/1000000,2) AS total \
FROM total_by_country \
GROUP BY year;"

In [72]:
data1 = pd.read_sql_query(query1, engine)

In [73]:
data1.head()

   year    total
0  2010   870.68
1  2011   932.37
2  2012   938.54
3  2013   953.25
4  2014  1001.46

In [74]:
data1.to_excel('2010_2021_tableau.xlsx', 'Sheet1', index=False)

-- 2. Passenger percentage difference from 2010 to 2021 comparison

In [89]:
query2 = "SELECT y2 AS year, CONCAT(round((total2-total1)*100/total1), '%%') AS percentage_difference \
FROM( \
SELECT * FROM (SELECT year AS y1, round(SUM(value)/1000000,2) AS total1 \
FROM total_by_country \
WHERE year BETWEEN '2010' AND '2021' \
GROUP BY year) sub1 \
JOIN (SELECT year as y2, round(SUM(value)/1000000,2) AS total2 \
FROM total_by_country \
WHERE year BETWEEN '2010' AND '2021' \
GROUP BY year) sub2 \
ON sub1.y1 = sub2.y2 - 1) sub3;"

In [90]:
data2 = pd.read_sql_query(query2, engine)

In [91]:
data2.head()

   year percentage_difference
0  2011                    7%
1  2012                    1%
2  2013                    2%
3  2014                    5%
4  2015                    6%

In [93]:
data2.to_excel('percentage_diff_2010_2021_tableau.xlsx', 'Sheet1', index=False)

-- 3. pct difference between 2019 and 2021

In [94]:
query3 = "SELECT y1 AS between_2019, y2 AS and_2021, CONCAT(round((total2-total1)*100/total1), '%%') AS percentage_difference \
FROM( \
SELECT * FROM (SELECT year AS y1, round(SUM(value)/1000000,2) AS total1 \
FROM total_by_country \
WHERE year BETWEEN '2018' AND '2021' \
GROUP BY year) sub1 \
JOIN (SELECT year as y2, round(SUM(value)/1000000,2) AS total2 \
FROM total_by_country \
WHERE year BETWEEN '2018' AND '2021' \
GROUP BY year) sub2 \
ON sub1.y1 ='2019' AND sub2.y2='2021') sub3;"

In [95]:
data3 = pd.read_sql_query(query3, engine)

In [96]:
data3.head()

   between_2019  and_2021 percentage_difference
0          2019      2021                  -63%

In [97]:
data3.to_excel('pct_diff_2019_2021_tableau.xlsx', 'Sheet1', index=False)

-- 4. Top 10 country has the most air traffic in 2021

In [98]:
query4 = "SELECT *, ROUND(SUM(value)/1000000,2) AS total \
FROM total_by_country \
WHERE year = 2021 \
GROUP BY country \
ORDER BY total DESC \
LIMIT 10;"

In [99]:
data4 = pd.read_sql_query(query4, engine)

In [101]:
data4.head(10)

   index country_code      country  year     value  total
0    119           ES        Spain  2021  91898241  91.90
1     71           DE      Germany  2021  73597370  73.60
2    143           FR       France  2021  66030409  66.03
3    191           IT        Italy  2021  59546376  59.55
4    107           EL       Greece  2021  32245559  32.25
5    251           NL  Netherlands  2021  29082583  29.08
6    275           PT     Portugal  2021  22347692  22.35
7    263           PL       Poland  2021  18894053  18.89
8     23           BE      Belgium  2021  13500020  13.50
9     11           AT      Austria  2021  11105564  11.11

In [102]:
data4.to_excel('top_10_countries_2021_tableau.xlsx', 'Sheet1', index=False)

-- 5. Top 10 airport has the most air traffic in 2021

In [111]:
query5 = "SELECT airport_code, airport, year, ROUND(value/1000000,2) AS million \
FROM top_10_airport \
ORDER BY value DESC \
LIMIT 10;"

In [112]:
data5 = pd.read_sql_query(query5, engine)

In [113]:
data5.head()

  airport_code                          airport  year  million
0      FR_LFPG  Paris Charles de Gaulle Airport  2021    26.19
1      NL_EHAM       Amsterdam Airport Schiphol  2021    25.49
2      DE_EDDF  Frankfurt International Airport  2021    24.77
3      ES_LEMD           Madrid-Barajas Airport  2021    23.19
4      ES_LEBL  Barcelona International Airport  2021    18.48

In [114]:
data5.to_excel('top_10_airports_2021_tableau.xlsx', 'Sheet1', index=False)

-- 6. Regional destinations from EU to other countries in 2021, passenger count descending order

In [134]:
query6 = "SELECT region, round(value/1000000,2) AS total_million, start_latitude, start_longitude, end_latitude, end_longitude \
FROM eu_to_world \
WHERE year = '2021' \
GROUP BY region \
ORDER BY value DESC;"

In [135]:
data6 = pd.read_sql_query(query6, engine)

In [136]:
data6.head()

,region,total_million,start_latitude,start_longitude,end_latitude,end_longitude
0,North America,13.77,50.378472,14.970598,43.448934,-103.020636
1,Central America and Caribbean,5.20,50.378472,14.970598,20.530026,-73.239431
2,South America,3.89,50.378472,14.970598,-16.809795,-58.196417
3,Africa,0.92,50.378472,14.970598,5.662755,20.619970
4,Asia,0.17,50.378472,14.970598,37.764292,99.509360

In [137]:
data6.to_excel('eu_to_world_2021_tableau.xlsx', 'Sheet1', index=False)

-- 7. Regional passenger comparison between 2020 and 2021 -percentages %

In [138]:
query7 ="SELECT abc1.region, total_2020, total_2021, round((total_2021-total_2020)*100/total_2020) AS percentage_diff, \
abc1.start_latitude, abc1.start_longitude, abc1.end_latitude, abc1.end_longitude \
FROM \
(SELECT region, round(value/1000000,2) AS total_2020, start_latitude, start_longitude, end_latitude, end_longitude \
FROM eu_to_world \
WHERE year = '2020' \
GROUP BY region) abc1 \
INNER JOIN \
(SELECT region, round(value/1000000,2) AS total_2021 \
FROM eu_to_world \
WHERE year = '2021' \
GROUP BY region) abc2 \
ON abc1.region = abc2.region \
ORDER BY percentage_diff DESC;"

In [139]:
data7 = pd.read_sql_query(query7, engine)

In [140]:
data7.head()

,region,total_2020,total_2021,percentage_diff,start_latitude,start_longitude,end_latitude,end_longitude
0,Central America and Caribbean,3.35,5.20,55.0,50.378472,14.970598,20.530026,-73.239431
1,Africa,0.64,0.92,44.0,50.378472,14.970598,5.662755,20.619970
2,Asia,0.12,0.17,42.0,50.378472,14.970598,37.764292,99.509360
3,North America,9.85,13.77,40.0,50.378472,14.970598,43.448934,-103.020636
4,Oceania and southern polar regions,0.11,0.11,0.0,50.378472,14.970598,-27.596967,148.965118

In [141]:
data7.to_excel('pct_eu_to_world_2021_tableau.xlsx', 'Sheet1', index=False)

In [145]:
query8 ="SELECT tra_name AS destination, ROUND(value/1000000,2) value \
FROM intra_extra_national;"

In [153]:
data8 = pd.read_sql_query(query8, engine)

In [154]:
data8.head()

   destination   value
0  Internal_EU  141.50
1  External_EU  146.27
2     National   85.97

In [156]:
data8.to_excel('int_ext_nat_tableau.xlsx', 'Sheet1', index=False)

### About 2022

In [175]:
data_info(by_country_monthly_2018_2022)

dataframe shape:

(1891, 11)

dataframe head

,DATAFLOW,LAST UPDATE,freq,unit,tra_meas,tra_cov,schedule,geo,TIME_PERIOD,OBS_VALUE,OBS_FLAG
0,ESTAT:AVIA_PAOC(1.0),05/12/22 23:00:00,M,PAS,PAS_CRD,TOTAL,TOT,AT,2018-01,1905331,NaN
1,ESTAT:AVIA_PAOC(1.0),05/12/22 23:00:00,M,PAS,PAS_CRD,TOTAL,TOT,AT,2018-02,1937152,NaN
2,ESTAT:AVIA_PAOC(1.0),05/12/22 23:00:00,M,PAS,PAS_CRD,TOTAL,TOT,AT,2018-03,2404430,NaN
3,ESTAT:AVIA_PAOC(1.0),05/12/22 23:00:00,M,PAS,PAS_CRD,TOTAL,TOT,AT,2018-04,2442085,NaN
4,ESTAT:AVIA_PAOC(1.0),05/12/22 23:00:00,M,PAS,PAS_CRD,TOTAL,TOT,AT,2018-05,2585884,NaN

dataframe NaN values sum

DATAFLOW          0
LAST UPDATE       0
freq              0
unit              0
tra_meas          0
tra_cov           0
schedule          0
geo               0
TIME_PERIOD       0
OBS_VALUE         0
OBS_FLAG       1891
dtype: int64

dataframe data types

DATAFLOW        object
LAST UPDATE     object
freq            object
unit            object
tra_meas        object
tra_cov         object
schedule        object
geo             object
TIME_PERIOD     object
OBS_VALUE        int64
OBS_FLAG       float64
dtype: object

dataframe column unique values

DATAFLOW          1
LAST UPDATE       1
freq              1
unit              1
tra_meas          1
tra_cov           1
schedule          1
geo              34
TIME_PERIOD      59
OBS_VALUE      1891
OBS_FLAG          0
dtype: int64

In [177]:
by_country_monthly_2018_2022 = clean_by_country(by_country_monthly_2018_2022)

In [178]:
by_country_monthly_2018_2022.head()

  country_code     year    value
0           AT  2018-01  1905331
1           AT  2018-02  1937152
2           AT  2018-03  2404430
3           AT  2018-04  2442085
4           AT  2018-05  2585884

In [179]:
by_country_monthly_2018_2022['country'] = by_country_monthly_2018_2022['country_code'].apply(lambda x: country_names(x))
by_country_monthly_2018_2022 = by_country_monthly_2018_2022[['country_code','country','year','value']]

In [182]:
by_country_monthly_2018_2022 = by_country_monthly_2018_2022[by_country_monthly_2018_2022.country != 'U']

Import the data to SQL

In [184]:
by_country_monthly_2018_2022.to_sql('by_country_monthly_2018_2022', engine, if_exists = 'replace')

1520

In [224]:
query9 = "SELECT country_code, country, left(year,4) AS year, right(year,2) AS month, round(value/1000000,2) AS monthly_value \
FROM by_country_monthly_2018_2022 \
WHERE (right(year,2) BETWEEN '01' AND '12') AND (left(year,4) BETWEEN '2018' AND '2022');"

In [225]:
data9 = pd.read_sql_query(query9, engine)

In [226]:
data9.head()

  country_code  country  year month  monthly_value
0           AT  Austria  2018    01           1.91
1           AT  Austria  2018    02           1.94
2           AT  Austria  2018    03           2.40
3           AT  Austria  2018    04           2.44
4           AT  Austria  2018    05           2.59

In [228]:
data9.to_excel('by_month_2018_2022.xlsx', 'Sheet1', index=False)

In [231]:
monthly_2010_2022.head()

,DATAFLOW,LAST UPDATE,freq,unit,tra_meas,tra_cov,schedule,geo,TIME_PERIOD,OBS_VALUE,OBS_FLAG
0,ESTAT:AVIA_PAOC(1.0),03/01/23 11:00:00,M,PAS,PAS_CRD,TOTAL,TOT,EU27_2020,2010-01,42469506,NaN
1,ESTAT:AVIA_PAOC(1.0),03/01/23 11:00:00,M,PAS,PAS_CRD,TOTAL,TOT,EU27_2020,2010-02,41428261,NaN
2,ESTAT:AVIA_PAOC(1.0),03/01/23 11:00:00,M,PAS,PAS_CRD,TOTAL,TOT,EU27_2020,2010-03,51408081,NaN
3,ESTAT:AVIA_PAOC(1.0),03/01/23 11:00:00,M,PAS,PAS_CRD,TOTAL,TOT,EU27_2020,2010-04,46789778,NaN
4,ESTAT:AVIA_PAOC(1.0),03/01/23 11:00:00,M,PAS,PAS_CRD,TOTAL,TOT,EU27_2020,2010-05,61096256,NaN

In [233]:
monthly_2010_2022 = clean_by_country(monthly_2010_2022)

In [234]:
monthly_2010_2022.head()

  country_code     year     value
0    EU27_2020  2010-01  42469506
1    EU27_2020  2010-02  41428261
2    EU27_2020  2010-03  51408081
3    EU27_2020  2010-04  46789778
4    EU27_2020  2010-05  61096256

In [235]:
monthly_2010_2022.to_excel('monthly_2010_2022.xlsx', 'Sheet1', index=False)

## Hypothesis 2: Average passenger of first 6 months in 2022 is more than 15 million

In [219]:
query10 = 'SELECT SUM(monthly_value) \
FROM (SELECT country_code, country, left(year,4) AS year, right(year,2) AS month, value AS monthly_value \
FROM by_country_monthly_2018_2022 \
WHERE (right(year,2) BETWEEN 01 AND 06) AND (left(year,4) BETWEEN 2018 AND 2022)) abc6 \
WHERE year = 2022 \
GROUP BY country;'

In [220]:
data10 = pd.read_sql_query(query10, engine)

In [221]:
# To test our hypothesis we will apply one-sided test:
# Null hypothesis or H0: Average of passengers >= 15 million
# Alternative hyp or H1: Average of passengers < 15 million

In [222]:
from scipy.stats import ttest_1samp

stat, pval = ttest_1samp(data10, 15000000)

In [223]:
print('stat is  ', stat)
print('pvalue for the one-tailed test is ', pval/2)

stat is   [0.39370318]
pvalue for the one-tailed test is  [0.34850521]

As per p value greater than 0.05 and stat is positive, we accept that average first 6 months of 2022 is greater than 15 million